#+title: Arrays
**** std::size
To get teh *size* of an array one can use std::size()
#+BEGIN_SRC C++ :results output :exports both :flags "-std=c++23" :cmdline "-o prog" :classname main
#include <print>
using namespace std;

int main() {
  int my_array[4] {2};

  print("The size of the array is {}", size(my_array));
}
#+END_SRC

#+RESULTS:
: The size of the array is 4

**** sizeof
There is anotehr way to get the size, using /sizeof/ operator, which return the size _in bytes_. So for example,
#+BEGIN_SRC C++ :results output :exports both :flags "-std=c++23" :cmdline "-o prog" :classname main
#include <print>
using namespace std;

int main() {
  double my_array[4] {2};

  print("The size of the array is {}", sizeof(my_array)/sizeof(my_array[0]));
}
#+END_SRC

#+RESULTS:
: The size of the array is 4

** /std::optional/
It is defined in <optional>. It manages an *optional* given value, meaning that the value may be there _or not_.
For example, it can be used when a function fails. At any point of the code, an optional either contains something, or it contains nothing.

To know if the optional contains something, one can use
- /.has_value()/ : returns true or false
- /.value() : returns the value (if any/). If the optional is empty, an exeption is thrown (warning).
- /.value_or(x) : returns the value (if any). If empty, returns x.


#+BEGIN_SRC C++ :results output :exports both :flags "-std=c++23" :cmdline "-o prog" :classname main
#include <iostream>
using namespace std;

//Example of a function returning an std::optional containing an int
optional<int> getData(bool giveIt)
{
  if (giveIt) {
    return 42;
  }
  return nullopt; // or simply return {};
}

int main(){

optional<int> data1 { getData(true) };
optional<int> data2 { getData(false) };

//using has_value
println("data1.has_value = {}", data1.has_value());

//using if statement
if (!data2) println("data2 has no value.");


//access the value
println("data1.value = {}", data1.value());

//the dereferencing operator can also be used
 println("data1.value = {}", *data1);

//access when empty using value_or
println("data1.value = {}", data2.value_or(0));
}
#+END_SRC

#+RESULTS:
: data1.has_value = true
: data2 has no value.
: data1.value = 42
: data1.value = 42
: data1.value = 0

